content/docs/getting-started.md
+++
title = "Getting Started"
author = ["Mattox Beckman"]
draft = false
weight = 2
date = 2022-08-22
publishdate = 2022-07-01
+++

## How Do I Get Started? {#how-do-i-get-started}

-   Join the CampusWire forum.  If you registered before class started, you should have gotten an invite.  If you registered late,
    or did not get the invite, you need to email the instructor.
-   It is recommended that you get these books:
    -   [Competitive Programming 4](https://cpbook.net).  It is a two book set.
    -   [Guide to Competitive Programming](https://link.springer.com/book/10.1007/978-3-319-72547-5).  As of this writing the PDF is free.
-   Register on [Code Forces](https://codeforces.com).  Your username **will be visible** to other students; you can create a "throwaway"
    account if you want just for this course.
    -   Once you are registered, join [the class group](https://codeforces.com/group/C1FCILxvRp/contests).  This is where your problems
        will be hosted.
-   Also register on <https://vjudge.net>
    -   THe class group is at <https://vjudge.net/group/uiuc-cs491-sp23>


## How do I get good at this? {#how-do-i-get-good-at-this}

Practice.  A lot.  But do it efficiently...

-   Attend contests as much as you can.
    -   [Code Forces](https://codeforces.com) has two hour long contests usually once or twice a week, for instance.
    -   After the contest is over, read the commentary, both for the problems you solved, and the problems you attempted and could not solve.
    -   Upsolve the ones you couldn't do.  (I don't know why they call it upsolving.)  This means that you go back to the computer, finish
        your solution, and submit it until you get it accepted.
-   Solve practice problems
    -   This has a similar feel, but in this case it's okay get help.  If you are solving UVa problems you can use the UDebug and UHunt
        sites for extra hints / sample inputs.
